; domain
(define (domain emergency)
  (:requirements :strips :typing)

  (:types
    drone
    person
    crate
    location
    content
    arm
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (arm-of ?a - arm ?d - drone)
    (free ?a - arm)
    (holding ?a - arm ?c - crate)

    (crate-has ?c - crate ?t - content)
    (person-has ?p - person ?t - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
    )
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-crate ?c ?l)
      (arm-of ?a ?d)
      (free ?a)
    )
    :effect (and
      (not (at-crate ?c ?l))
      (not (free ?a))
      (holding ?a ?c)
    )
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?t - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (arm-of ?a ?d)
      (holding ?a ?c)
      (crate-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (free ?a)
      (not (holding ?a ?c))
    )
  )

)

; problem
(define (problem emergency-problem2)
  (:domain emergency)

  (:objects
    d1 - drone
    a1 a2 - arm

    p1 p2 - person

    c1 c2 c3 - crate

    depot l1 l2 - location

    food medicine - content
  )

  (:init
    (at-drone d1 depot)

    (arm-of a1 d1)
    (arm-of a2 d1)
    (free a1)
    (free a2)

    (at-person p1 l1)
    (at-person p2 l2)

    (at-crate c1 depot)
    (at-crate c2 depot)
    (at-crate c3 depot)

    (crate-has c1 food)
    (crate-has c2 medicine)
    (crate-has c3 food)
  )

  (:goal
    (and
      (person-has p1 food)
      (person-has p2 medicine)
    )
  )
)

; plan
1. (pick-up d1 a1 c1 depot)
   deleted: (at-crate c1 depot) (free a1)
   added: (holding a1 c1)
   goals met: 0 of 2
2. (pick-up d1 a2 c2 depot)
   deleted: (at-crate c2 depot) (free a2)
   added: (holding a2 c2)
   goals met: 0 of 2
3. (fly d1 depot l1)
   deleted: (at-drone d1 depot)
   added: (at-drone d1 l1)
   goals met: 0 of 2
4. (deliver d1 a1 c1 p1 l1 food)
   deleted: (holding a1 c1)
   added: (person-has p1 food) (free a1)
   goals met: 1 of 2
5. (fly d1 l1 l2)
   deleted: (at-drone d1 l1)
   added: (at-drone d1 l2)
   goals met: 1 of 2
6. (deliver d1 a2 c2 p2 l2 medicine)
   deleted: (holding a2 c2)
   added: (person-has p2 medicine) (free a2)
   goals met: 2 of 2
